# 专业技能考核

## 实验1

3个switch

 改名字, 加VLAN 2 3 4 



SW1   和sw2

```
#F0/2  分配VLAN 2
#F0/10         3
#F0/16         4

#f0/24
	sw  mode tu	 #改成trunk
```

cent

```
#f0/1
	switchport trunk encapsulation dot1q  
	switchport mode trunk 
#f0/2 同上

#f0/21
	switchport access vlan 10 # 改vlan10
```

pc2

|          | pc2           | pc5           | pc3           | pc4           | 。。。 |
| :------- | :------------ | ------------- | ------------- | ------------- | ------ |
| IP       | 172.16.2.10   | 172.16.2.11   | 172.16.3.10   | 172.16.4.10   |        |
| sub mask | 255.255.255.0 | 255.255.255.0 | 255.255.255.0 | 255.255.255.0 |        |
| gateway  | 172.16.2.251  | 172.16.2.251  | 172.16.3.251  | 172.16.4.251  |        |

> pc2 : ping 172.16.2.11 能通   172.16.1.10 不能通



cent

```
int vlan 1
	ip add 172.16.1.251 255.255.255.0
 	no shutdown
 	exit
 int vlan 2 、3、4、10
 	...同上
 	
 	
ip routing
```

cent

```
Switch(config)#int f0/23
Switch(config-if)#no switchport 
Switch(config-if)#ip address 172.16.11.1 255.255.255.0
Switch(config-if)#no shutdown 
Switch(config-if)#exit

Switch(config)#int f0/24
Switch(config-if)#no switchport 
Switch(config-if)#ip address 172.16.12.1 255.255.255.0
Switch(config-if)#no shutdown 
Switch(config-if)#
```

r1

```
r1(config)#interface FastEthernet0/0
r1(config-if)#ip address 172.16.11.2 255.255.255.0
r1(config-if)#no shutdown


r1(config)#interface FastEthernet0/1
r1(config-if)#ip address 100.1.1.1 255.255.255.0
r1(config-if)#no shutdown
```

r2

```
r2(config)#interface FastEthernet0/1
r2(config-if)#ip address 100.1.1.2 255.255.255.0
r2(config-if)#no shutdown

r2(config)#interface FastEthernet0/0
r2(config-if)#ip address 200.1.1.251 255.255.255.0
r2(config-if)#no shutdown
```

r3

```
r3(config)#interface FastEthernet0/0
r3(config-if)#ip address 172.16.12.2 255.255.255.0
r3(config-if)#no shutdown



r3(config)#int s0/0/0
r3(config-if)#clock rate 2000000
r3(config-if)#ip address 11.1.1.1 255.255.255.0
r3(config-if)#no shutdown 
```

r4

```
r4(config)#interface Serial0/0/0
r4(config-if)#ip address 11.1.1.2 255.255.255.0
r4(config-if)#no shutdown

r4(config)#interface FastEthernet0/0
r4(config-if)#ip address 172.16.128.251 255.255.255.0
r4(config-if)#no shutdown
```

s0

```
200.1.1.10
255.255.255.0
200.1.1.251
```

> pc1 : ping 200.1.1.251 -> ' Destination host unreachable' 

cent

```
Switch(config)#ip route 100.1.1.0    255.255.255.0 172.16.11.2
Switch(config)#ip route 200.1.1.0    255.255.255.0 172.16.11.2
Switch(config)#ip route 11.1.1.0     255.255.255.0 172.16.12.2
Switch(config)#ip route 172.16.128.0 255.255.255.0 172.16.12.2
```

r1

```
r1(config)#ip route 200.1.1.0 255.255.255.0 100.1.1.2
r1(config)#ip route 0.0.0.0 0.0.0.0 172.16.11.1
```

r2

```
r2(config)#ip route 0.0.0.0 0.0.0.0 100.1.1.1
```

> pc1  ping 200.1.1.251 通了

DNS   视频#48:48    





## 实验2

ip 配置



neiwang

```bash
#int s0/0/0
ip add ...
encap ppp
```

Internet 1

```bash
#s0/0/0
en  ppp

#s0/0/1
en fr
```

Internet 2

```bash
#s0/0/1
en fr

#s0/0/0

```

waibuwang

```bash

```

cloud0

```bash
#24:04
```

neiwang

```
 ip route 0.0.0.0    0.0.0.0   202.1.1.2
```

internet 1

```
router ospf 10
	network 202.1.2.0  0.0.0.255 area 0 
```

internet 2

```
router ospf 10           
    network 202.1.2.0  0.0.0.255 area 0 
    exit
    
router rip
    network   202.1.3.0  
```

waibuwang

```
router rip
	network 202.1.3.0
    network 202.1.4.0
```

internet 1

```
router ospf 10
	neighbor 202.1.2.2  
```

internet 2

```
router ospf 10
	nei 202.1.2.1
```

internet 1

```bash
#还是在刚才的OSPF里
redistribute connected
re con me 3    # 38:20 删了
re co su
```

internet 2

```bash
router ospf 10
	re rip   # ???好像报错了  41:10
	exit
router rip
	re ospf 10 metric 2
	
#重启Internet1 s0/0/0 s0/0/1
```

neiwang

```bash
int s0/0/0
	ip nat ou
	exit
int f0/0
	ip nat in
	exit
acc 10 p 192.168.10.0    0.0.0.255
ip nat in  source list  10  interface s0/0/0 over 

# pc1 到pc0 去不了：
ip nat inside source static tcp 192.168.10.11 80 202.1.1.1 80 
```

```



```

DNS #54:07



## 实验3

12：50开始

lsw1 加vlan 10、20 

F0/2 -> vlan10  、F0/12 ->vlan20

F0/1 `sw mode tr`

|      | pc1           | pc2           |
| ---- | ------------- | ------------- |
|      | 192.168.10.10 | 192.168.20.10 |
|      | 255.255.255.0 | 255.255.255.0 |
|      | 192.168.10.1  | 192.168.20.1  |

AR1

```
 
AR1(config)#int f0/0.1
AR1(config-subif)#encapsulation dot1Q 10
AR1(config-subif)#ip add 192.168.10.1 255.255.255.0
AR1(config-subif)#exit

AR1(config)#int f0/0.2
AR1(config-subif)#encapsulation dot1Q 20
AR1(config-subif)#ip address 192.168.20.1 255.255.255.0
AR1(config-subif)#exit

AR1(config)#int f0/0
AR1(config-if)#no shutdown 

```

> pc1 ping pc2 应该能通   # 19:05

AR1

```
AR1(config)#interface Serial0/0/0
AR1(config-if)#
AR1(config-if)#ip address 10.1.13.1 255.255.255.0
AR1(config-if)#no shutdown 

AR1(config)#interface FastEthernet0/1
AR1(config-if)#
AR1(config-if)#ip address 10.1.12.1 255.255.255.0
AR1(config-if)#no shutdown

AR1(config)#int s0/0/0 
AR1(config-if)#encapsulation ppp 
AR1(config-if)#
```

AR3

```
AR3(config)#interface Serial0/0/0
AR3(config-if)#ip address 10.1.13.2 255.255.255.0

AR3(config)#interface Serial0/0/1
AR3(config-if)#ip address 10.1.23.1 255.255.255.0
AR3(config-if)#encapsulation ppp 
```

AR2

```
AR2(config)#interface Serial0/0/1
AR2(config-if)#ip address 10.1.23.2 255.255.255.0
AR2(config-if)#no shutdown 
AR2(config-if)#encapsulation ppp 

AR2(config)#interface FastEthernet0/1
AR2(config-if)#ip address 10.1.12.2 255.255.255.0
AR2(config-if)#no shutdown

AR2(config)#interface FastEthernet0/0
AR2(config-if)#ip address 10.1.14.1 255.255.255.0
AR2(config-if)#no shutdown


```

LSW2

```
LSW2(config)#interface FastEthernet0/1
LSW2(config-if)#no switchport 
LSW2(config-if)#ip address 10.1.14.2 255.255.255.0

LSW2(config)#vlan 10
LSW2(config-vlan)#exit

LSW2(config)#int f0/2
LSW2(config-if)#switchport access vlan 10
LSW2(config-if)#exit


LSW2(config)#int vlan 10
LSW2(config-if)#
%LINK-5-CHANGED: Interface Vlan10, changed state to up

LSW2(config-if)#ip address 172.16.1.1 255.255.255.0
LSW2(config-if)#no shutdown 
```

s0

```
172.16.1.10
255.255.255.0
172.16.1.1
```

> s0 ping 172.16.1.1 应该通
>
> ping 10.1.14.2 应该通  # 27:40

AR1

```
router ospf 10
network 192.168.10.0 0.0.0.255 area 0  
net     192.168.20.0 0.0.0.255 area 0
net     10.1.13.0 0.0.0.255 area 0
```

AR3

```
router ospf 10
net     10.1.13.0 0.0.0.255 area 0
net     10.1.23.0 0.0.0.255 area 0
```

AR2

```
router ospf 10
net     10.1.23.0 0.0.0.255 area 0
```

LWS2

```
ip route 0.0.0.0  0.0.0.0 10.1.14.1 
ip routing  
```

AR2

```
ip route 0.0.0.0  0.0.0.0 10.1.14.2 

router ospf 10
de or 
```

AR1

```
ip route 172.16.1.0 255.255.255.0 10.1.12.2 160
```

AR2

```
ip route 192.168.10.0 255.255.255.0 10.1.12.1 160
ip route 192.168.20.0 255.255.255.0 10.1.12.1 160
```

> pc2 :   ping -T  	172.16.1.10  应该通   #40：28

AR1

```
AR1(config)#int s0/0/0
AR1(config-if)#no shutdown 
```

AR3

```
AR3(config)#int s0/0/0
AR3(config-if)#ppp authentication pap 
Must set encapsulation to PPP before using PPP subcommands
AR3(config-if)#
AR3(config-if)#exit
AR3(config)#
AR3(config)#username AR1 password 123
```

AR1

```
AR1(config)#int s0/0/0
AR1(config-if)#ppp pap sent-username AR1 password 123
```

AR3

```
AR3(config)#interface Serial0/0/1
AR3(config-if)#ppp authentication chap 
AR3(config-if)#exit 

AR3(config)#username AR2 password 123456
```

AR2

```
user AR3 pa 123456 
```

> pc1 : ping 172.16.1.10 通  #47：58

AR2

```
acc  100 deny tcp 192.168.20.0  0.0.0.255 172.16.1.0 0.0.0.255 eq www 
acc 100 pe ip any any 

int f0/0
	ip access-group 100 out 
```

> pc2 :   ping 	172.16.1.10   通 # 51:45 
>
> 但是浏览器不能访问172.16.1.10   : '' Request Timeout '
>
> pc1 : ping 172.16.1.10 通  

AR2

```
 no acc  100
 
```

> pc2 浏览器能访问172.16.1.10 

AR1

```
AR1(config)#
AR1(config)#acc 100 de tcp 192.168.20.0 0.0.0.255 172.16.1.0 0.0.0.255 eq www 
AR1(config)#acc 100 per ip any any

AR1(config)#int f0/0.2
AR1(config-subif)#ip access-group 100 in 
```

> pc2 :   ping 	172.16.1.10   通 # 56:01
>
> 但是浏览器不能访问172.16.1.10 

AR2

```
AR2(config)#no access-list 100
AR2(config)#
AR2(config)#acc 10 de 192.168.10.0 0.0.0.255
AR2(config)#acc 10 per any 
AR2(config)#int f0/0
AR2(config-if)#ip access-group 10 out 
```

> pc1 ping 172.16.1.10  不可达
>
> pc2 ping 172.16.1.10  通   浏览器不能访问172.16.1.10 

