# 专业技能考核

## 实验1

3个switch

 改名字, 加VLAN 2 3 4 



SW1   和sw2

```
#F0/2  分配VLAN 2
#F0/10         3
#F0/16         4

#f0/24
	sw  mode tu	 #改成trunk
```

cent

```
#f0/1
	switchport trunk encapsulation dot1q  
	switchport mode trunk 
#f0/2 同上

#f0/21
	switchport access vlan 10 # 改vlan10
```

pc2

|          | pc2           | pc5           | pc3           | pc4           | 。。。 |
| :------- | :------------ | ------------- | ------------- | ------------- | ------ |
| IP       | 172.16.2.10   | 172.16.2.11   | 172.16.3.10   | 172.16.4.10   |        |
| sub mask | 255.255.255.0 | 255.255.255.0 | 255.255.255.0 | 255.255.255.0 |        |
| gateway  | 172.16.2.251  | 172.16.2.251  | 172.16.3.251  | 172.16.4.251  |        |

> pc2 : ping 172.16.2.11 能通   172.16.1.10 不能通



cent

```
int vlan 1
	ip add 172.16.1.251 255.255.255.0
 	no shutdown
 	exit
 int vlan 2 、3、4、10
 	...同上
 	
 	
ip routing
```

cent

```
Switch(config)#int f0/23
Switch(config-if)#no switchport 
Switch(config-if)#ip address 172.16.11.1 255.255.255.0
Switch(config-if)#no shutdown 
Switch(config-if)#exit

Switch(config)#int f0/24
Switch(config-if)#no switchport 
Switch(config-if)#ip address 172.16.12.1 255.255.255.0
Switch(config-if)#no shutdown 
Switch(config-if)#
```

r1

```
r1(config)#interface FastEthernet0/0
r1(config-if)#ip address 172.16.11.2 255.255.255.0
r1(config-if)#no shutdown


r1(config)#interface FastEthernet0/1
r1(config-if)#ip address 100.1.1.1 255.255.255.0
r1(config-if)#no shutdown
```

r2

```
r2(config)#interface FastEthernet0/1
r2(config-if)#ip address 100.1.1.2 255.255.255.0
r2(config-if)#no shutdown

r2(config)#interface FastEthernet0/0
r2(config-if)#ip address 200.1.1.251 255.255.255.0
r2(config-if)#no shutdown
```

r3

```
r3(config)#interface FastEthernet0/0
r3(config-if)#ip address 172.16.12.2 255.255.255.0
r3(config-if)#no shutdown



r3(config)#int s0/0/0
r3(config-if)#clock rate 2000000
r3(config-if)#ip address 11.1.1.1 255.255.255.0
r3(config-if)#no shutdown 
```

r4

```
r4(config)#interface Serial0/0/0
r4(config-if)#ip address 11.1.1.2 255.255.255.0
r4(config-if)#no shutdown

r4(config)#interface FastEthernet0/0
r4(config-if)#ip address 172.16.128.251 255.255.255.0
r4(config-if)#no shutdown
```

s0

```
200.1.1.10
255.255.255.0
200.1.1.251
```

> pc1 : ping 200.1.1.251 -> ' Destination host unreachable' 

cent

```
Switch(config)#ip route 100.1.1.0    255.255.255.0 172.16.11.2
Switch(config)#ip route 200.1.1.0    255.255.255.0 172.16.11.2
Switch(config)#ip route 11.1.1.0     255.255.255.0 172.16.12.2
Switch(config)#ip route 172.16.128.0 255.255.255.0 172.16.12.2
```

r1

```
r1(config)#ip route 200.1.1.0 255.255.255.0 100.1.1.2
r1(config)#ip route 0.0.0.0 0.0.0.0 172.16.11.1
```

r2

```
r2(config)#ip route 0.0.0.0 0.0.0.0 100.1.1.1
```

> pc1  ping 200.1.1.251 通了

DNS   视频#48:48    





## 实验2

ip 配置



neiwang

```bash
#int s0/0/0
ip add ...
encap ppp
```

Internet 1

```bash
#s0/0/0
en  ppp

#s0/0/1
en fr
```

Internet 2

```bash
#s0/0/1
en fr

#s0/0/0

```

waibuwang

```bash

```

cloud0

```bash
#24:04
```

neiwang

```
 ip route 0.0.0.0    0.0.0.0   202.1.1.2
```

internet 1

```
router ospf 10
	network 202.1.2.0  0.0.0.255 area 0 
```

internet 2

```
router ospf 10           
    network 202.1.2.0  0.0.0.255 area 0 
    exit
    
router rip
    network   202.1.3.0  
```

waibuwang

```
router rip
	network 202.1.3.0
    network 202.1.4.0
```

internet 1

```
router ospf 10
	neighbor 202.1.2.2  
```

internet 2

```
router ospf 10
	nei 202.1.2.1
```

internet 1

```bash
#还是在刚才的OSPF里
redistribute connected
re con me 3    # 38:20 删了
re co su
```

internet 2

```bash
router ospf 10
	re rip   # ???好像报错了  41:10
	exit
router rip
	re ospf 10 metric 2
	
#重启Internet1 s0/0/0 s0/0/1
```

neiwang

```bash
int s0/0/0
	ip nat ou
	exit
int f0/0
	ip nat in
	exit
acc 10 p 192.168.10.0    0.0.0.255
ip nat in  source list  10  interface s0/0/0 over 

# pc1 到pc0 去不了：
ip nat inside source static tcp 192.168.10.11 80 202.1.1.1 80 
```

```



```

DNS #54:07